{
  "title": "China Unveils $2 Trillion Stimulus Package – Biggest Since 2008",
  "category": "ECONOMY",
  "shortdescription": "Beijing floods economy with cash to hit 5% growth target – global markets surge.",
  "author": "Macro Anton",
  "authorImage": "/images/Author7.webp",
  "role": "Chief Economist",
  "date": "November 21, 2025",
  "readingTime": "10 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/China $2 Trillion Stimulus 2025.webp"
    },
    {
      "type": "heading",
      "content": "Beijing Goes All-In"
    },
    {
      "type": "paragraph",
      "content": "China has announced its largest stimulus package since the 2008 global financial crisis — a staggering $2 trillion program combining direct consumer subsidies, infrastructure spending, and property sector support. The People's Bank of China simultaneously cut interest rates to zero and launched a 1 trillion yuan direct-to-consumer digital yuan distribution program. The moves come as Beijing desperately tries to meet its 5% growth target amid the ongoing property crisis and weak domestic demand."
    },
    {
      "type": "paragraph",
      "content": "Global commodity markets exploded higher on the news: copper surged 8%, iron ore jumped 12%, and the Australian dollar gained 5% — its biggest one-day move in a decade. The stimulus includes $500 billion for local government debt restructuring, $800 billion for infrastructure, and $700 billion in consumer vouchers and tax cuts. This marks a dramatic policy pivot from Xi Jinping's previous 'common prosperity' campaign that targeted excessive debt."
    },
    {
      "type": "heading",
      "content": "Global Ripple Effects"
    },
    {
      "type": "paragraph",
      "content": "The announcement has sent shockwaves through global markets. European luxury stocks, Australian miners, and emerging market currencies all rallied sharply as investors bet on Chinese demand recovery. The move also puts pressure on other central banks to ease policy, with markets now pricing in deeper rate cuts from the ECB and Bank of England. While the stimulus provides short-term relief, analysts warn that China's structural challenges — aging population, high youth unemployment, and property overhang — remain unresolved."
    }
  ]
}