{
  "title": "Warren Buffett Sells $10B Apple Stake – Loads Up on T-Bills at 5.4%",
  "category": "INVESTING",
  "shortdescription": "Oracle of Omaha now holds record $325B cash pile — signals caution for 2026.",
  "author": "Mark Blaze",
  "authorImage": "/images/Author4.webp",
  "role": "Value Investing Expert",
  "date": "November 21, 2025",
  "readingTime": "11 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/Warren Buffett Sells 10B Apple Stake 2025.webp"
    },
    {
      "type": "heading",
      "content": "Buffett’s Biggest Move in a Decade"
    },
    {
      "type": "paragraph",
      "content": "Warren Buffett has stunned Wall Street by selling $10 billion worth of Apple shares in a single week — reducing Berkshire Hathaway’s stake in the iPhone maker by 40%. The proceeds were immediately reinvested into short-term U.S. Treasury bills yielding 5.4%, bringing Berkshire’s cash pile to a record $325 billion. This marks the largest single-stock reduction in Buffett’s 60-year career and the biggest cash position in company history. The move comes as Apple faces slowing iPhone sales in China and increasing competition from Huawei and Xiaomi."
    },
    {
      "type": "paragraph",
      "content": "Market analysts interpret this as Buffett’s strongest caution signal since 2008. The Oracle of Omaha has long warned about overvalued tech stocks and has been gradually trimming his Apple position since 2023. The 5.4% T-bill yield — the highest since 2007 — appears to have finally tipped the scales. Berkshire now holds more in cash and Treasuries than the market cap of most S&P 500 companies. This defensive posture suggests Buffett believes current valuations are stretched and a market correction may be imminent."
    },
    {
      "type": "heading",
      "content": "What This Means for Investors"
    },
    {
      "type": "paragraph",
      "content": "Buffett’s actions carry enormous weight in financial circles. His move into T-bills at 5.4% while the S&P 500 trades at 28x earnings sends a clear message: opportunity cost has finally become too high. Many value investors are following suit, rotating out of growth stocks into fixed income. The 10-year Treasury yield has fallen to 4.1% in response, while growth stocks have underperformed value by 8% since the sale was announced. For retail investors, this serves as a reminder that even the greatest growth stories eventually face gravity."
    }
  ]
}