[
 {
    "slug": "the-pitt-noah-wyle-medical-drama-returns",
    "title": "The Pitt: Noah Wyle's Intense ER-Style Medical Drama Is Already Renewed for Season 2",
    "category": "DRAMA",
    "shortdescription": "Real-time hospital chaos is back – and critics say it's the best medical show in decades.",
    "description": "Noah Wyle leads Max's adrenaline-fueled drama set over one insane 15-hour ER shift – fast-tracked for Season 2 after record viewership.",
    "image": "/images/The Pitt Noah Wyle's Intense ER-Style Medical.webp",
    "author": "TV Insider",
    "authorImage": "/images/tv-insider.webp",
    "role": "Drama Correspondent",
    "date": "November 20, 2025"
  },
  {
    "slug": "i-love-la-rachel-sennott-hilarious-dark-drama",
    "title": "I Love LA: Rachel Sennott's Messy Millennial Drama Is the Funniest Show of 2025",
    "category": "DRAMA",
    "shortdescription": "Codependent friends, bad boyfriends, and Hollywood dreams – the dramedy you can't stop watching.",
    "description": "Rachel Sennott shines in HBO's sharp, chaotic portrait of twenty-somethings chasing fame and love in Los Angeles.",
    "image": "/images/I Love LA Rachel Sennott's Messy Millennial Drama.webp",
    "author": "TV Insider",
    "authorImage": "/images/tv-insider.webp",
    "role": "Drama Correspondent",
    "date": "November 17, 2025"
  },
  {
    "slug": "stranger-things-final-season-first-look-teaser",
    "title": "Stranger Things Final Season: First Explosive Teaser Drops – Hawkins Is Doomed",
    "category": "DRAMA",
    "shortdescription": "The beginning of the end – Netflix drops emotional first look at the epic conclusion.",
    "description": "Part 1 of Stranger Things Season 5 lands November 26 – bigger battles, returning favorites, and the showdown fans have waited years for.",
    "image": "/images/Stranger Things Final Season First Explosive Teaser.webp",
    "author": "TV Insider",
    "authorImage": "/images/tv-insider.webp",
    "role": "Drama Correspondent",
    "date": "November 20, 2025"
  }
]